[
  {
    "url": "https://en.wikipedia.org/wiki/Causes_of_cancer",
    "paragraph": "Cancer is caused by genetic changes leading to uncontrolled cell growth and tumor formation. The basic cause of sporadic (non-familial) cancers is DNA damage[citation needed] and genomic instability."
  },
  {
    "url": "https://en.wikipedia.org/wiki/Carcinogenesis",
    "paragraph": "Carcinogenesis, also called oncogenesis or tumorigenesis, is the formation of a cancer, whereby normal cells are transformed into cancer cells."
  },
  {
    "url": "https://en.wikipedia.org/wiki/Carcinogenesis#Cancer_cell_biology",
    "paragraph": "Pre-malignant tissue can have a distinctive appearance under the microscope. Among the distinguishing traits of a pre-malignant lesion are an increased number of dividing cells, variation in nuclear size and shape, variation in cell size and shape, loss of specialized cell features, and loss of normal tissue organization.."
  },
  {
    "url": "https://en.wikipedia.org/wiki/Causes_of_cancer#Lifestyle",
    "paragraph": "Many different lifestyle factors contribute to increasing cancer risk. Together, diet and obesity are related to approximately 30–35% of cancer deaths.[8][30] Dietary recommendations for cancer prevention typically include an emphasis on vegetables, fruit, whole grains, and fish, and avoidance of processed meat, red meat, animal fats, and refined carbohydrates.[31] The evidence to support these dietary changes is not definitive."
  },
  {
    "url": "https://en.wikipedia.org/wiki/Cancer#Classification",
    "paragraph": "Cancers are classified by the type of cell that the tumor cells resemble and is therefore presumed to be the origin of the tumor."
  },
  {
    "url": "https://en.wikipedia.org/wiki/Cancer#Research",
    "paragraph": "Experimental cancer treatments are studied in clinical trials to compare the proposed treatment to the best existing treatment."
  },
  {
    "url": "https://en.wikipedia.org/wiki/Cancer#Diagnosis",
    "paragraph": "Most cancers are initially recognized either because of the appearance of signs or symptoms or through screening."
  },
  {
    "url": "https://en.wikipedia.org/wiki/Cancer#Heredity",
    "paragraph": "The vast majority of cancers are non-hereditary (sporadic). Hereditary cancers are primarily caused by an inherited genetic defect."
  },
  {
    "url": "https://en.wikipedia.org/wiki/Cancer#Prevention",
    "paragraph": "Cancer prevention is defined as active measures to decrease cancer risk. The vast majority of cancer cases are due to environmental risk factors. Many of these environmental factors are controllable lifestyle choices. Thus, cancer is generally preventable."
  },
 
  
]
